import React from 'react';
import { Card, Col, Row } from 'antd';

const CardList = () => (
	<div className="m-list">
	    <Row>
	      <Col span="12">
	        <Card title="标题" extra={<a href="#">更多</a>} >
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
	        </Card>
	      </Col>
	      <Col span="12">
	        <Card title="标题" extra={<a href="#">更多</a>} >
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
	        </Card>
	      </Col>
	    </Row>
	    <Row>
	      <Col span="12">
	        <Card title="标题" extra={<a href="#">更多</a>} >
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
	        </Card>
	      </Col>
	      <Col span="12">
	        <Card title="标题" extra={<a href="#">更多</a>} >
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
	        </Card>
	      </Col>
	    </Row>
	    <Row>
	      <Col span="12">
	        <Card title="标题" extra={<a href="#">更多</a>} >
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
	        </Card>
	      </Col>
	      <Col span="12">
	        <Card title="标题" extra={<a href="#">更多</a>} >
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
		        <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
			    <p>内容内容内容内容内容内容内容</p>
	        </Card>
	      </Col>
	    </Row>
	</div>
);

export default CardList;